DorrAndKloker/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    top
    {
        type            patch;
        nFaces          209;
        startFace       44335;
    }
    wallBottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          109;
        startFace       44544;
    }
    inlet
    {
        type            patch;
        nFaces          109;
        startFace       44653;
    }
    outlet
    {
        type            patch;
        nFaces          109;
        startFace       44762;
    }
    wallExposed
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          68;
        startFace       44871;
    }
    wallRhoC
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          50;
        startFace       44939;
    }
    back
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          22331;
        startFace       44989;
    }
    front
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          22331;
        startFace       67320;
    }
)

// ************************************************************************* //
