DorrAndKloker/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/


// Sampling and I/O settings
#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type            sets;
libs            ("libsampling.so");

//writeControl    writeTime;

interpolationScheme cellPoint;

setFormat   csv;

setConfig
{
    type    lineCell;
    axis    distance;  // x, y, z, xyz
	nPoints 30;
}

sets
(
    u-0_1
    {
        $setConfig;
        start (-0.1 0.0 0.01);
	end   (-0.1 0.01  0.01);
    }
	
    u-0_05
    {
        $setConfig;
        start (-0.05 0.0 0.01);
	end   (-0.05 0.01 0.01);
    }
	
    u0_0
    {
        $setConfig;
        start (0.0 0.0 0.01);
	end   (0.0 0.01 0.01);
    }

    u0_05
    {
        $setConfig;
        start (0.05 0.0 0.01);
	end   (0.05 0.01 0.01);
    }
	
    u0_1
    {
        $setConfig;
        start (0.1 0.0 0.01);
	end   (0.1 0.01 0.01);
    }
	
);

fields  (U);

// ************************************************************************* //
